
% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Sat, Dec 23, 2023 - 11:55:2Executing: StataMP analyze_data.do >> "../output/make.log"
\centering 
  \caption{Results} 
  \label{} 
\begin{tabular}{@{\extracolsep{5pt}}lD{.}{.}{-3} D{.}{.}{-3} D{.}{.}{-3} } 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
 & \multicolumn{3}{c}{\textit{Dependent variable:}} \\ 
\cline{2-4} 
\\[-1.8ex] & \multicolumn{3}{c}{Engine displacement (L)} \\ 
\\[-1.8ex] & \multicolumn{1}{c}{(1)} & \multicolumn{1}{c}{(2)} & \multicolumn{1}{c}{(3)}\\ 
\hline \\[-1.8ex] 
 City fuel economy (mpg) & -0.242^{***} &  & -0.233^{***} \\ 
  & (0.012) &  & (0.041) \\ 
  & & & \\ 
 Highway fuel economy (mpg) &  & -0.166^{***} & -0.007 \\ 
  &  & (0.009) & (0.029) \\ 
  & & & \\ 
 Constant & 7.558^{***} & 7.368^{***} & 7.565^{***} \\ 
  & Saving 7 x 7 in image
Saving 7 x 7 in image
\hline \\[-1.8ex] 
Observations & \multicolumn{1}{c}{234} & \multicolumn{1}{c}{234} & \multicolumn{1}{c}{234} \\ 
R$^{2}$ & \multicolumn{1}{c}{0.638} & \multicolumn{1}{c}{0.587} & \multicolumn{1}{c}{0.638} \\ 
Adjusted R$^{2}$ & \multicolumn{1}{c}{0.636} & \multicolumn{1}{c}{0.585} & \multicolumn{1}{c}{0.635} \\ 
Residual Std. Error & \multicolumn{1}{c}{0.779 (df = 232)} & \multicolumn{1}{c}{0.832 (df = 232)} & \multicolumn{1}{c}{0.781 (df = 231)} \\ 
F Statistic & \multicolumn{1}{c}{408.248$^{***}$ (df = 1; 232)} & \multicolumn{1}{c}{329.453$^{***}$ (df = 1; 232)} & \multicolumn{1}{c}{203.319$^{***}$ (df = 2; 231)} \\ 
\hline 
\hline \\[-1.8ex] 
\textit{Note:}  & \multicolumn{3}{r}{$^{*}$p$<$0.1; $^{**}$p$<$0.05; $^{***}$p$<$0.01} \\ 
\end{tabular} 
\end{table} 

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata
> .com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core , expiring 21 Jul 2024
Serial number: 501809310346
  Licensed to: Matthew Gentzkow
               Stanford University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help
          obs_advice.
      4. Maximum number of variables is set to 5,000 but can be
          increased; see help set_maxvar.

. do analyze_data.do 

. * ====================================================================
> =========
. * Short description of script's purpose
. * ====================================================================
> =========
. 
. clear all

. adopath + "../../lib/stata"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/gentzkow/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/gentzkow/Library/Application Support/Stata/ad
> o/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../../lib/stata"

. set linesize 100

. 
. * Paths
. global input_dir "../../1_data/output"

. global output_dir "../output"

. 
. * =============================================================================
. 
. program main
  1.     use "$input_dir/mpg.dta", clear
  2.     regression_table
  3.         city_figure
  4.         hwy_figure
  5. end

. 
. program regression_table
  1.         reg displ cty
  2.         estimates store cty
  3.         
.         reg displ hwy
  4.         estimates store hwy
  5.         
.         reg displ hwy cty
  6.         estimates store hwy_cty
  7.         
.         esttab hwy cty hwy_cty using $output_dir/table_reg.tex, replace
  8. end

. 
. program city_figure
  1.     scatter cty displ, xtitle("Engine displacement (L)") ///
>                 ytitle("City fuel economy (mpg)") ///
>                 mcolor(year)
  2.         graph export $output_dir/figure_city.jpg, replace
  3. end

. 
. program hwy_figure
  1.     scatter hwy displ, xtitle("Engine displacement (L)") ///
>                 ytitle("Highway fuel economy (mpg)") ///
>                 mcolor(year)
  2.         graph export $output_dir/figure_hwy.jpg, replace
  3. end

. 
. * Execute
. main
file ../../1_data/output/mpg.dta not found
r(601);

end of do-file
r(601);
